import pandas as pd
df = pd.read_csv("split.csv")
df

In [7]:
df.pivot(index="day",columns="city",values="windspeed")

city        mumbai  new york  paris
day
01-01-2017       5         6     20
01-02-2017      12         7     13
01-03-2017      15        12      8
01-04-2017       5         7     10

In [10]:
df.pivot(index="day",columns="city",values="temperature")

city        mumbai  new york  paris
day
01-01-2017      90        32     45
01-02-2017      85        36     50
01-03-2017      87        28     54
01-04-2017      92        33     42